Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: Swift examines Objective-C method declarations and translates them into Swift throwing methods, with shorter names when possible.
ja: Swiftは、Objective-Cメソッド宣言を調べて、それらをSwiftスローメソッドへと、可能な場合はより短い名前で翻訳します。

source: Swift imports C unions as Swift structures.
ja: スウィフトは、C共用体をスウィフト構造体としてインポートします。

source: Swift imports Cocoa methods with error parameters as throwing methods, as described in About Imported Cocoa Error Parameters.
ja: Swiftは、エラーパラメータを持つCocoaメソッドをスローメソッドとしてインポートします、インポートされるCocoaエラーパラメータについてで記述されるように。

source: Swift imports Objective-C methods that take a completion handler as two related Swift methods: a method that takes a closure, and an asynchronous method that doesn’t take a closure.
ja: Swiftは、完了ハンドラをとるObjective-Cメソッドを２つの同族のSwiftメソッド：あるクロージャをとるメソッド、そしてクロージャをとらない非同期メソッドとしてインポートします。

source: Swift imports any C structure declared in a C header as a Swift structure.
ja: スウィフトは、Cヘッダにおいて宣言されるどんなC構造体もスウィフト構造体としてインポートします。

source: Swift imports any function declared in a C header as a Swift global function.
ja: スウィフトは、Cヘッダにおいて宣言されるどんな関数もスウィフトのグローバルな関数としてインポートします。

source: Swift imports bit fields that are declared in structures, like those found in Foundation’s NSDecimal type, as computed properties.
ja: Swiftは、構造体において宣言されるビットフィールド、FoundationのNSDecimal型において見つけられるそれらに似たもの、を計算プロパティとしてインポートします。

source: Swift includes modern features like type inference, optionals, and closures, which make the syntax concise yet expressive.
ja: Swiftは、型推論、オプショナル、そしてクロージャのような、モダンな機能を含みます、それは構文を簡潔にその上さらに表現豊かにします。

source: Swift is developed in the open.
ja: Swiftは、オープンに開発されます。

source: Swift makes it easy to create arrays in your code using an array literal: simply surround a comma-separated list of values with square brackets.
ja: Swiftはあなたのコードにおいて配列の作成を配列リテラルを使って簡単にします：単純にコンマ区切りの値のリストを角括弧で囲んでください。

source: Swift numeric types (Int, Float, and so on)
ja: Swift数値型（Int、Float、など）

source: Swift only imports C variadic functions that use a va_list for their arguments.
ja: Swiftは、C可変長引数関数で、va_listをそれの引数として使うものをインポートするだけです。

source: Swift provides a default debugging textual representation for any type.
ja: Swiftは、省略時のデバッグ用テキスト表現をあらゆる型に提供します。

source: Swift sees every header you expose publicly in your umbrella header.
ja: Swiftは、あなたがパブリックにあなたのアンブレラヘッダにおいて露出するすべてのヘッダを見ます。

source: Swift uses only simple Boolean values in conditional contexts to help avoid accidental programming errors and to help maintain the clarity of each control statement.
ja: Swiftは、単純なブール値だけを条件文脈において使用することによって、思いがけないプログラミングエラーを防ぐのを助けます、そして各制御文の明瞭性を保つのを助けます。

source: Swift value type
ja: Swift値型

source: Swift will automatically use DefaultStringInterpolation as the interpolation type and provide an implementation for init(stringInterpolation:) that passes the interpolated literal’s contents to init(stringLiteral:), so you don’t need to implement anything specific to this protocol.
ja: Swiftは、自動的にDefaultStringInterpolationを補間型として使います、そしてinit(stringInterpolation:)に対する実装を提供し、それは補間されたリテラルの内容をinit(stringLiteral:)に渡します、それであなたはこのプロトコルに特有な何かを実装する必要はありません。

source: Swift wraps these returned Core Foundation objects in an Unmanaged<Instance> structure.
ja: Swiftは、これらの返されたCore Foundationオブジェクトを Unmanaged<Instance>構造体でラップします。

source: Swift’s enumerations are well suited to represent simple errors.
ja: Swiftの列挙は、単純なエラーを表すのによく適します。

source: Task Group Cancellation
ja: タスクグループ取り消し

source: Testing
ja: テスト

source: That continuation is Sendable, in that it is intended to be used from concurrent contexts external to the iteration of the AsyncStream.
ja: その継続は、それがAsyncStreamの反復に関係ない並行性文脈から使われるよう意図されるという点でSendableです。

source: That default representation is used by the String(reflecting:) initializer and the debugPrint(_:) function for types that don’t provide their own.
ja: 省略時の表現は、String(reflecting:)イニシャライザおよびdebugPrint(_:)関数によって、それらが自前で提供しない型に対して使われます。

source: That is, bitPattern % MemoryLayout<Pointee>.alignment must be 0.
ja: すなわち、bitPattern % MemoryLayout<Pointee>.alignmentは、0でなければなりません。

source: That is, for any elements a, b, and c, the following conditions must hold:
ja: すなわち、何らかの要素a、b、そしてcに対して、以下の条件が保持されなければなりません：

source: That is, for any index i into a bidirectional collection c:
ja: すなわち、二方向性のコレクションcに対する何らかのインデックスiは：

source: That is, if x is an instance of Double, then Double(x.description) == x is always true.
ja: すなわち、xがDoubleのインスタンスならば、そのときDouble(x.description) == xは常に真です。

source: That is, if x is an instance of Float16, then Float16(x.description) == x is always true.
ja: すなわち、xがFloat16のインスタンスならば、そのときFloat16(x.description) == xは常に真です。

source: That is, if x is an instance of Float80, then Float80(x.description) == x is always true.
ja: すなわち、xがFloat80のインスタンスならば、そのときFloat80(x.description) == xは常に真です。

source: That is, if x is an instance of Float, then Float(x.description) == x is always true.
ja: すなわち、xがFloatのインスタンスならば、そのときFloat(x.description) == xは常に真です。

source: That is, if source is negative, the result is padded with ones; otherwise, the result is padded with zeros.
ja: すなわち、sourceが負ならば、結果は１で詰め物をされます；そうでなければ、結果はゼロで詰め物をされます。

source: That is, when working with a slice of a mutable collection that has value semantics, such as an array, mutating the original collection triggers a copy of that collection and does not affect the contents of the slice.
ja: すなわち、値意味論を持つ可変コレクション、例えば配列などのスライスを扱う場合、元のコレクションを変化させることはそのコレクションのコピーを引き起こし、スライスの内容に作用しません。

source: That method call automatically triggers the observer's change handler:
ja: そのメソッド呼び出しは、自動的にオブザーバの持つ変更ハンドラを誘発します：

source: That same value is too large to represent as an Int8 instance, so the second conversion fails, triggering a runtime error.
ja: その同じ値は、Int8インスタンスとして表すには大きすぎます、それで２番目の変換は、実行時エラーを引き起こして失敗します。

source: That way, Swift can handle memory management for you.
ja: そのように、スウィフトはあなたの代わりにメモリ管理をうまく取り扱うことができます。

source: That will ensure that isKnownUniquelyReferenced(_:) only returns true when there is really one accessor, or when there is a race condition, which is already undefined behavior.
ja: それはisKnownUniquelyReferenced(_:)が本当に１つのアクセッサしかない時に、またはすでに未定義挙動であるところの競合状態の時にtrueを返すだけであるのを確実にします。

source: The IEEE 754 specification defines a canonical, or preferred, encoding of a floating-point value.
ja: IEEE 754仕様は、ある正準の、または推奨の、浮動小数点値のエンコーディングを定義します。

source: The &<<= operator performs a masking shift, where the value used as rhs is masked to produce a value in the range 0...bitWidth.
ja: &<<=演算子は、マスクするシフトを実行します、そこにおいてrhsとして使われる値はマスクされることで範囲0...bitWidthの中の値を生成します。

source: The &>>= operator performs a masking shift, where the value passed as rhs is masked to produce a value in the range 0...bitWidth.
ja: &>>=演算子は、マスクするシフトを実行します、そこにおいてrhsとして渡される値はマスクされることで範囲0...bitWidthの中の値を生成します。

source: The * operator implements the multiplication operation defined by the IEEE 754 specification.
ja: *演算子は、IEEE 754 仕様によって定義される乗算演算子を実装します。

source: The + operator implements the addition operation defined by the IEEE 754 specification.
ja: +演算子は、IEEE 754 仕様によって定義される加算演算子を実装します。

source: The - operator implements the subtraction operation defined by the IEEE 754 specification.
ja: -演算子は、IEEE 754 仕様によって定義される減算演算子を実装します。

source: The / operator implements the division operation defined by the IEEE 754 specification.
ja: /演算子は、IEEE 754 仕様によって定義される除算演算子を実装します。

source: The << operator performs a smart shift, which defines a result for a shift of any value.
ja: <<演算子は、ある賢いシフトを実行します、それは何らかの値のシフトに対する結果を定義します。

source: The == comparison and the contains(_:) method call in the following example depend on strings and integers being equatable:
ja: ==比較とcontains(_:)メソッド呼び出しは以下の例において、文字列と整数がequatableであることに依存します：

source: The >> operator performs a smart shift, which defines a result for a shift of any value.
ja: >>演算子は、ある賢いシフトを実行します、それは何らかの値のシフトに対する結果を定義します。

source: The >>= operator performs a smart shift, which defines a result for a shift of any value.
ja: >>=演算子は、ある賢いシフトを実行します、それは何らかの値のシフトに対する結果を定義します。

source: The Actor protocol generalizes over all actor types.
ja: Actorプロトコルは、アクター型を端から端まで一般化します。

source: The AdditiveArithmetic protocol provides a suitable basis for additive arithmetic on scalar values, such as integers and floating-point numbers, or vectors.
ja: AdditiveArithmeticプロトコルは、例えば整数および浮動小数点数、またはベクターなど、スカラー値に関する加算算術にふさわしい基礎を提供します。

source: The AnyHashable type forwards equality comparisons and hashing operations to an underlying hashable value, hiding the type of the wrapped value.
ja: AnyHashable型は、さまざまな同等性比較およびハッシュ演算をある基盤をなすハッシュ可能値に転送して、ラップされた値の型を隠しています。

source: The ArraySlice type makes it fast and efficient for you to perform operations on sections of a larger array.
ja: ArraySlice型は、ある大きな配列の各部分上で演算を実行することをあなたの代わりにより速くより効率的にします。

source: The AsyncIteratorProtocol defines the type returned by the makeAsyncIterator() method of the AsyncSequence protocol.
ja: AsyncIteratorProtocolは、AsyncSequenceプロトコルのmakeAsyncIterator()メソッドによって返される型を定義します。

source: The BinaryFloatingPoint protocol extends the FloatingPoint protocol with operations specific to floating-point binary types, as defined by the IEEE 754 specification.
ja: BinaryFloatingPointプロトコルは、FloatingPointプロトコルを、IEEE 754仕様で定義されるとおりに、浮動小数点バイナリ型に特有の演算で拡張します。

source: The BinaryInteger protocol is the basis for all the integer types provided by the standard library.
ja: BinaryIntegerプロトコルは、標準ライブラリによって提供される全ての整数型の土台です。

source: The Character type represents a character made up of one or more Unicode scalar values, grouped by a Unicode boundary algorithm.
ja: Character型は、あるユニコード境界アルゴリズムによって一群にされる、ひとつ以上のユニコードスカラー値から成り立っている１つの文字を表します。

source: The Collection protocol declares and provides default implementations for many operations that depend on elements being accessible by their subscript.
ja: Collectionプロトコルは、多くの演算に対して省略時の実装を宣言および提供していて、それは要素がそれらの添え字によってアクセス可能になっているのを当てにします。

source: The CollectionOfTwo structure is a fixed-size collection that always holds two elements of a specific type.
ja: このCollectionOfTwo構造体は固定サイズのコレクションです、それは常にある決まった型の２つの要素を保持します。

source: The Comparable protocol is used for types that have an inherent order, such as numbers and strings.
ja: Comparableプロトコルは、本来備わっている順番を持つ型、例えば数や文字列などで使われます。

source: The ContiguousArray and ArraySlice types are not bridged; instances of those types always have a contiguous block of memory as their storage.
ja: ContiguousArrayとArraySlice型はブリッジされません；それらの型のインスタンスは常に隣接するメモリブロックをそれらのストレージとして持ちます。

source: The ContiguousArray type is a specialized array that always stores its elements in a contiguous region of memory.
ja: ContiguousArrayは、それの要素がメモリの隣接領域に常に格納される特殊化された配列です。

source: The FixedWidthInteger protocol adds binary bitwise operations, bit shifts, and overflow handling to the operations supported by the BinaryInteger protocol.
ja: FixedWidthIntegerプロトコルは、バイナリビット単位演算子、ビットシフト、そしてオーバーフロー処理を、BinaryIntegerプロトコルによってサポートされる演算に加えます。

source: The FloatingPoint protocol declares common arithmetic operations, so you can write functions and algorithms that work on any floating-point type.
ja: FloatingPointプロトコルは通常の算術演算子を宣言します、それであなたは何らかの浮動小数点型上で働く関数およびアルゴリズムを書くことができます。

source: The IndexingIterator type is the default iterator for any collection that doesn’t declare its own.
ja: IndexingIterator型は、それ独自のものを宣言しないあらゆるコレクションに対する省略時のイテレータです。

source: The NO macro from Objective-C is bridged to Swift as an ObjCBool value of false.
ja: Objective-CからのNOマクロは、falseのObjCBool値としてSwiftにブリッジされます。

source: The Player type is a class, so it doesn't qualify for automatic synthesis of the Equatable or Hashable requirements.
ja: Player型はクラスです、なのでそれはEquatableまたはHashable要件の自動的な合成の基準を満たしません。

source: The Set and Array types each handle array literals in their own way to create new instances.
ja: SetとArray型は、それぞれ配列リテラルをそれら独自の方法で取り扱って、新しいインスタンスを作成します。

source: The StreetAddress type now conforms to Equatable.
ja: StreetAddress型は、今やEquatableに準拠します。

source: The String and StaticString types conform to the ExpressibleByStringLiteral protocol.
ja: StringとStaticString型は、ExpressibleByStringLiteralプロトコルに準拠します。

source: The String, StaticString, Character, and Unicode.Scalar types all conform to the ExpressibleByUnicodeScalarLiteral protocol.
ja: String、StaticString、Character、そしてUnicode.Scalar型は、すべてExpressibleByUnicodeScalarLiteralプロトコルに準拠します。

source: The String, StaticString, and Character types conform to the ExpressibleByExtendedGraphemeClusterLiteral protocol.
ja: String、StaticString、そしてCharacter型は、ExpressibleByExtendedGraphemeClusterLiteralプロトコルに準拠します。

source: The StringLiteralType of an interpolation type must match the StringLiteralType of the conforming type.
ja: 補間型のStringLiteralTypeは、準拠している型のStringLiteralTypeと合致しなければなりません。

source: The Unmanaged<Instance> structure provides two methods to convert an unmanaged object to a memory-managed object—takeUnretainedValue() and takeRetainedValue().
ja: Unmanaged<Instance>構造体は、２つのメソッドを、管理されないオブジェクトをメモリ管理されたオブジェクトに変換するために提供します ― takeUnretainedValue()とtakeRetainedValue()。

source: The Words type must conform to the RandomAccessCollection protocol with an Element type of UInt and Index type of Int.
ja: Words型は、RandomAccessCollectionプロトコルに、UIntのElement型そしてIntのIndex型を使って準拠しなければなりません。

source: The base property can be cast back to its original type using one of the type casting operators (as?, as!, or as).
ja: baseプロパティは、それの元の型へキャストされて戻されることが型キャスト演算子（as?、as!、またはas）を使って可能です。

source: The binaryString implementation uses the static bitWidth property and the right shift operator (>>), both of which are available to any type that conforms to the FixedWidthInteger protocol.
ja: binaryString実装は、静的bitWidthプロパティと右シフト演算子（>>）を使います、それらの両方ともFixedWidthIntegerプロトコルに準拠するあらゆる型で使用可能です。

source: The exponent property has the following edge cases:
ja: exponentプロパティは、次の境界事例を持ちます：

source: The firstSpace constant is an index into the text string—the position of the first space in the string.
ja: firstSpace定数は、text文字列へのあるインデックス — その文字列の中の最初の空白の位置、です。

source: The getDefaultValue(_:) function uses optional chaining to safely call the implicitly unwrapped class method on c.
ja: getDefaultValue(_:)関数は、オプショナル連鎖を使って、暗黙的にアンラップされるクラスメソッドをc上で安全に呼び出します。

source: The hash(into:) method in this example feeds the grid point’s x and y properties into the provided hasher.
ja: hash(into:)メソッドはこの例において、格子点のもつxとyプロパティをその提供されたhasherへと与えます。

source: The high component of the value carries the sign, if the type is signed.
ja: 値のhigh構成部分は符号を運びます、その型が符号付きならば。

source: The index(after:) method for advancing an index into your collection
ja: あるインデックスをあなたのコレクションにおいて前に進めるためのindex(after:)メソッド

source: The invalidInput case includes the invalid character as an associated value.
ja: invalidInputケース節は、無効な文字を関連値として含みます。

source: The isEqual(to:) method implements the equality predicate defined by the IEEE 754 specification.
ja: isEqual(to:)メソッドは、IEEE 754仕様によって定義される同等性述部を実装します。

source: The isKnownUniquelyReferenced(_:) function is useful for implementing the copy-on-write optimization for the deep storage of value types:
ja: isKnownUniquelyReferenced(_:)関数は、値型の深い貯蔵に対してコピーオンライト最適化を実装するのに便利です：

source: The isLess(than:) method implements the less-than predicate defined by the IEEE 754 specification.
ja: isLess(than:)メソッドは、IEEE 754仕様によって定義される「より少ない」述部を実装します。

source: The isLessThanOrEqualTo(_:) method implements the less-than-or-equal predicate defined by the IEEE 754 specification.
ja: isLessThanOrEqualTo(_:)メソッドは、IEEE 754仕様によって定義される「より少ないか等しい」述部を実装します。

source: The isTotallyOrdered(belowOrEqualTo:) method implements the total order relation as defined by the IEEE 754 specification.
ja: isTotallyOrdered(belowOrEqualTo:)メソッドは、全順序関係をIEEE 754仕様によって定義されるとおりに実装します。

source: The isZero property of a value x is true when x represents either -0.0 or +0.0.
ja: ある値xのisZeroプロパティがtrueであるのは、xが-0.0または+0.0のどちらかを表す場合です。

source: The joined method is always lazy, but does not implicitly confer laziness on algorithms applied to its result.
ja: joinedメソッドは常に遅延です、しかしそれの結果に適用されるアルゴリズム上に、遅延性を暗黙的に授けられません。

source: The maximum method implements the maxNum operation defined by the IEEE 754 specification.
ja: maximumメソッドは、IEEE 754仕様によって定義されるmaxNum演算を実装します。

source: The maximumMagnitude method implements the maxNumMag operation defined by the IEEE 754 specification.
ja: maximumMagnitudeメソッドは、IEEE 754仕様によって定義されるmaxNumMag演算を実装します。

source: The minimum method implements the minNum operation defined by the IEEE 754 specification.
ja: minimumメソッドはminNum演算を実装します、それはIEEE 754仕様によって定義されます。

source: The minimumMagnitude method implements the minNumMag operation defined by the IEEE 754 specification.
ja: minimumMagnitudeメソッドは、IEEE 754仕様によって定義されるminNumMag演算を実装します。

source: The nextPartialResult closure executes sequentially with an accumulating value initialized to initialResult and each element of the sequence.
ja: nextPartialResultクロージャは、initialResultへと初期化された蓄積値とそのシーケンスの各要素を使って連続して遂行します。

source: The nextPartialResult closure is called sequentially with an accumulating value initialized to initialResult and each element of the sequence.
ja: nextPartialResultクロージャは、initialResultへと初期化された蓄積値とシーケンスの各要素とともに連続して呼び出されます。

source: The nextPartialResult closure is called with initialResult—0 in this case—and the first element of numbers, returning the sum: 1.
ja: nextPartialResultクロージャが、initialResult—この場合では0—そしてnumbersの最初の要素とともに呼び出されて、その合計：1を返します。

source: The nextPartialResult closure receives initialResult the first time the closure executes.
ja: nextPartialResultクロージャは、initialResultを、そのクロージャが遂行される最初の時に受け取ります。

source: The nextPartialResult closure receives initialResult the first time the closure runs.
ja: nextPartialResultは、initialResultを、クロージャが動作する最初の時に受け取ります。

source: The numbers array is now arranged in two partitions.
ja: numbers配列は今や２つの区分に整頓されます。

source: The offset value is the offset of the element to be removed in the original state of the collection.
ja: offset値は、コレクションの元の状態での取り除かれることになる要素のオフセットです。

source: The offset value is the offset of the inserted element in the final state of the collection after the difference is fully applied.
ja: offset値は、差異が完全に適用される後のコレクションの最終的状態でのその挿入された要素のオフセットです。

source: The perform(_:simultaneouslyWith:) function ends with a call to the sync(flags:execute:) method using the .barrier flag, which forces the function to wait until both closures have completed running before returning.
ja: perform(_:simultaneouslyWith:)関数は、sync(flags:execute:)メソッドへの .barrierフラグを使った呼び出しで終わります、それはその関数に返る前に両方のクロージャが実行を完了し終わるまで待つことを強要します。

source: The r1 range is bounded on the lower end by 0 because that is the starting index of the numbers array.
ja: r1範囲は、0によって下端に境界をつけられます、なぜならそれがnumbers配列の開始インデックスだからです。

source: The random() static method chooses a random value from a continuous uniform distribution in range, and then converts that value to the nearest representable value in this type.
ja: random()静的メソッドは無作為の値をrangeの中の連続一様分布から選びます、それからその値をその型で表現可能な最も近い値に変換します。

source: The random(in:using:) static method chooses a random value from a continuous uniform distribution in range, and then converts that value to the nearest representable value in this type.
ja: random(in:using:)静的メソッドは無作為の値をrangeの中の連続一様分布から選びます、それからその値をその型で表現可能な最も近い値に変換します。

source: The responseMessages variable is inferred to have type [Int: String].
ja: responseMessages変数は、型[Int: String]を持つと推論されます。

source: The round() method uses the .toNearestOrAwayFromZero rounding rule, where a value halfway between two integral values is rounded to the one with greater magnitude.
ja: round()メソッドは.toNearestOrAwayFromZero丸め規則を使います、そこでは２つの整数値の間の中ほどの値はより大きい規模を持つものへと丸められます。

source: The rounded() method uses the .toNearestOrAwayFromZero rounding rule, where a value halfway between two integral values is rounded to the one with greater magnitude.
ja: rounded()メソッドは.toNearestOrAwayFromZero丸め規則を使います、そこでは２つの整数値の間の中ほどの値はより大きい規模を持つものへと丸められます。

source: The sign property is .minus if the value’s signbit is set, and .plus otherwise.
ja: signプロパティは、値のsignbitがセットされるならば.minusです、そしてそうでないなら.plusです。

source: The significandBitPattern property does not include the leading integral bit of the significand, even for types like Float80 that store it explicitly.
ja: significandBitPatternプロパティは、仮数の先頭整数ビットを含みません、それを明示的に格納するFloat80のような型に対してさえも。

source: The sink closure is called with each resulting UTF-32 code unit as the function iterates over its input.
ja: sinkクロージャは、結果UTF-32コードユニットそれぞれで、それのinputに反復していく関数として呼び出されます。

source: The startIndex and endIndex properties
ja: startIndexおよびendIndexプロパティ

source: The sum() method is now available on any sequence with values that conform to AdditiveArithmetic, whether it is an array of Double or a range of Int.
ja: sum()メソッドは、今ではAdditiveArithmeticに準拠する値をもつあらゆるシーケンス上で利用可能です、それがDoubleからなる配列であろうと Intからなるある範囲であろうと。

source: The ulpOfOne constant corresponds to the C macros FLT_EPSILON, DBL_EPSILON, and others with a similar purpose.
ja: ulpOfOne定数は、CマクロFLT_EPSILON、DBL_EPSILON、そして類似した目的を持つ他のものに相当します。

source: The updateAccumulatingResult closure is called sequentially with a mutable accumulating value initialized to initialResult and each element of the sequence.
ja: updateAccumulatingResultクロージャは、initialResultへと初期化された可変の蓄積値とシーケンスの各要素とともに連続して呼び出されます。

source: The updateAccumulatingResult closure is called with the initial accumulating value—[:] in this case—and the first character of letters, modifying the accumulating value by setting 1 for the key "a".
ja: updateAccumulatingResultクロージャが、初期蓄積値—この場合では[:]—そしてlettersの最初の文字とともに呼び出されて、1をキー"a"に対して設定することで蓄積値を修正します。

source: The withUnsafeMutablePointer(to:_:) function is useful for calling Objective-C APIs that take in/out parameters (and default-constructible out parameters) by pointer.
ja: withUnsafeMutablePointer(to:_:)関数は、ポインタによって「in/out」パラメータ（そして何もしなくとも構築可能な「out」パラメーター）を取るObjective-C APIを呼ぶのに役立ちます。

source: The withUnsafePointer(to:_:) function is useful for calling Objective-C APIs that take in parameters by const pointer.
ja: withUnsafePointer(to:_:)関数は、constポインタによってパラメータを取り入れるObjective-C APIを呼び出すのに役立ちます。

source: The flatMap(_:) method “flattens” the resulting sequence-of-sequences into a single AsyncSequence.
ja: flatMap(_:)メソッドは、結果のシーケンスのシーケンスを単一のAsyncSequenceへと “平坦にします”。

source: The withVaList(_:_:) function takes an array of CVarArg values and provides a CVaListPointer value within the body of a closure parameter, whereas the getVaList(_:) function returns this value directly.
ja: withVaList(_:_:)関数は、CVarArg値からなるひとつの配列をとって、CVaListPointer値をクロージャパラメータの本体内で提供します、一方でgetVaList(_:)関数はこの値を直接に返します。

source: The CFTypeRef type completely remaps to the AnyObject type.
ja: CFTypeRef型は、AnyObject型に完全にリマップされます。

source: The Hashable protocol inherits from the Equatable protocol, so you must also satisfy that protocol’s requirements.
ja: Hashableプロトコルは、Equatableプロトコルから継承します、それであなたは同様にそのプロトコルのもつ要件も満たさなければなりません。

source: The binade property is a member of the same binade as this value, but with a unit significand.
ja: binadeプロパティは、この値と同じbinadeに属するあるメンバです、しかしある単位仮数を持ちます。

source: The id type is instead imported by Swift as the Any type.
ja: id型は、代わりにSwiftによってAny型としてインポートされます。

source: The Array type’s append(_:) and append(contentsOf:) methods take care of this detail for you, but reserveCapacity(_:) allocates only as much space as you tell it to (padded to a round value), and no more.
ja: Array型のもつappend(_:)とappend(contentsOf:)メソッドは、この詳細をあなたの代わりに面倒を見ます、しかしreserveCapacity(_:)はあなたがそれに伝える（ある丸め値に詰め込まれた）のと同じ程度の空間だけをアロケートして、それ以上は何もしません。

source: The BinaryInteger protocol provides initializers for four different kinds of conversion.
ja: BinaryIntegerプロトコルは、イニシャライザを４つの異なる種類の変換に対して提供します。

source: The CompassDirection example above demonstrates this automatic implementation.
ja: 上のCompassDirection例は、この自動実装を実演します。

source: The formRemainder(dividingBy:) method is always exact.
ja: formRemainder(dividingBy:)メソッドは常に正確です。
